app/Http/Controllers/Gudang/OpnameSessionController.php

    public function index(Request $request)
    {
        $user = Auth::user();
        $role = strtolower((string) ($user?->role ?? ''));

        $allowedWarehouseId = WarehouseConfig::getAllowedId($role);

        $query = StockOpnameSession::with(['warehouse', 'creator', 'approver'])
            ->orderByDesc('created_at');

        if ($allowedWarehouseId !== null) {
            $query->where('warehouse_id', $allowedWarehouseId);
        }

        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        if ($request->filled('q')) {
            $q = trim((string) $request->q);
            $sanitizedQ = SearchSanitizer::sanitize($q);
            $query->where(function ($sub) use ($sanitizedQ) {
                $sub->where('reference_number', 'like', '%'.$sanitizedQ.'%')
                    ->orWhereHas('creator', function ($u) use ($sanitizedQ) {
                        $u->where('name', 'like', '%'.$sanitizedQ.'%');
                    });
            });
        }

        $sessions = $query->paginate(15)->withQueryString();
---
select * from `stock_opname_sessions` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `stock_opname_sessions`