app/Http/Controllers/Warehouse/WarehouseOrderController.php

    public function index(Request $request)
    {
        $warehouseId = $request->user()->warehouse_id ?? $request->get('warehouse_id');

        // Auto-backfill for legacy transactions that were missing source_warehouse_id
        $missingTxs = Transaction::where('status', 'completed')
            ->where('delivery_status', 'pending')
            ->whereNull('source_warehouse_id')
            ->get();
---
select * from `transactions` where `status` = 'completed' and `delivery_status` = 'pending' and `source_warehouse_id` is null

    public function show(Transaction $order)
    {
        $order->load(['details.product', 'details.warehouse', 'user', 'customer', 'sourceWarehouse',
                      'packedBy', 'checkedBy', 'deliveredBy', 'additionalTransactions.details.product']);
---
select * from `customers` where `customers`.`id` in (1) and `customers`.`deleted_at` is null
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (1)
select * from `warehouses` where `warehouses`.`id` in (1)