app/Services/PosTransactionService.php

select * from `product_stocks` where `product_stocks`.`product_id` in (1, 2)
select * from `products` where `id` in (1, 2) and `products`.`deleted_at` is null for update
select * from `units` where `units`.`id` in (1, 2, 3, 4)
select * from `warehouses` where `warehouses`.`id` in (1, 2)
---
    public function lockAndLoadProducts(array $productIds): \Illuminate\Support\Collection
    {
        // Sort IDs to prevent deadlock
        sort($productIds);

        return Product::with(['unitConversions.unit', 'productStocks.warehouse'])
            ->whereIn('id', $productIds)
            ->lockForUpdate()
            ->get()
            ->keyBy('id');

select * from `product_stocks` where `product_id` = 2 and `warehouse_id` = 1 and `stock` > 0 order by `expired_date` asc, `created_at` asc for update
insert into `stock_movements` (`product_id`, `warehouse_id`, `location_id`, `type`, `source_type`, `reference_number`, `batch_number`, `expired_date`, `quantity`, `balance`, `notes`, `user_id`, `updated_at`, `created_at`) values (2, 1, null, 'out', 'pos_transaction', 'POS-GROSIR-24', null, null, 200, 8547, '[GROSIR] Transaksi #24', 1, '2026-04-14 16:36:47', '2026-04-14 16:36:47')
---
    public function deductWarehouseStock(
        int $productId,
        int $warehouseId,
        int $qty,
        int $transactionId,
        string $productName,
        string $posType // 'eceran' or 'grosir'
    ): void {
        $remaining = $qty;

        $stocks = ProductStock::where('product_id', $productId)
            ->where('warehouse_id', $warehouseId)
            ->where('stock', '>', 0)
            ->orderBy('expired_date', 'asc')
            ->orderBy('created_at', 'asc')
            ->lockForUpdate()
            ->get();

        foreach ($stocks as $stock) {
            if ($remaining <= 0) {
                break;
            }

            $deduct = min($stock->stock, $remaining);
            $stock->stock -= $deduct;
            $stock->save();

            // Catat ke StockMovement
            $referencePrefix = $posType === 'grosir' ? 'POS-GROSIR' : 'POS-ECERAN';
            StockMovement::create([
                'product_id' => $productId,
                'warehouse_id' => $warehouseId,
                'location_id' => $stock->location_id,
                'type' => 'out',
                'source_type' => 'pos_transaction',
                'reference_number' => $referencePrefix . '-' . $transactionId,
                'batch_number' => $stock->batch_number,
                'expired_date' => $stock->expired_date,
                'quantity' => $deduct,
                'balance' => $stock->stock,
                'notes' => '[' . strtoupper($posType) . '] Transaksi #' . $transactionId,
                'user_id' => Auth::id(),
            ]);

insert into `transactions` (`user_id`, `customer_id`, `source_warehouse_id`, `total_amount`, `paid_amount`, `change_amount`, `payment_method`, `payment_reference`, `sale_type`, `status`, `updated_at`, `created_at`) values (1, null, 1, 2847000, 2850000, 3000, 'cash', null, 'grosir', 'completed', '2026-04-14 16:36:47', '2026-04-14 16:36:47')
insert into `transaction_details` (`transaction_id`, `product_id`, `warehouse_id`, `unit_conversion_id`, `unit_qty`, `unit_name`, `quantity`, `price`, `subtotal`, `updated_at`, `created_at`) values (24, 2, 1, 117, 1, 'Dus', 200, 14235, 2847000, '2026-04-14 16:36:47', '2026-04-14 16:36:47')
---
    public function createTransaction(array $data, array $items): Transaction
    {
        $trx = Transaction::create([
            'user_id' => Auth::id(),
            'customer_id' => $data['customer_id'] ?? null,
            'total_amount' => $data['total_amount'],
            'paid_amount' => $data['paid_amount'],
            'change_amount' => max(0, $data['paid_amount'] - $data['total_amount']),
            'payment_method' => $data['payment_method'],
            'payment_reference' => $data['payment_reference'] ?? null,
            'status' => 'completed',
        ]);

        foreach ($items as $item) {
            TransactionDetail::create([
                'transaction_id' => $trx->id,
                'product_id' => $item['product_id'],
                'warehouse_id' => $item['warehouse_id'],
                'unit_conversion_id' => $item['unit_conversion_id'] ?? null,
                'unit_qty' => $item['unit_qty'] ?? null,
                'unit_name' => $item['unit_name'] ?? null,
                'quantity' => $item['quantity'],
                'price' => $item['price'],
                'subtotal' => $item['subtotal'],
            ]);

select * from `pos_sessions` where `status` = 'open' order by `created_at` desc limit 1
---
    public function validatePosSession(): void
    {
        $activeSession = \App\Models\PosSession::where('status', 'open')->latest()->first();