app/Services/ProductSearchService.php

    public function getProductsQuery(): \Illuminate\Database\Eloquent\Builder
    {
        return Product::with(['category', 'unitConversions.unit', 'productStocks.warehouse'])
            ->orderBy('name');
---
select * from `categories` where `categories`.`id` in (3)
select * from `product_stocks` where `product_stocks`.`product_id` in (1, 2)
select * from `units` where `units`.`id` in (1, 2, 3, 4)
select * from `warehouses` where `warehouses`.`id` in (1, 2)

    public function searchProducts(?string $query, int $limit = 20): Collection
    {
        $products = $this->getProductsQuery();

        if ($query) {
            $sanitizedQuery = SearchSanitizer::sanitize($query);
            $products->where(function ($q) use ($sanitizedQuery) {
                $q->where('name', 'like', "%{$sanitizedQuery}%")
                    ->orWhere('sku', 'like', "%{$sanitizedQuery}%")
                    ->orWhereHas('category', fn ($c) => $c->where('name', 'like', "%{$sanitizedQuery}%"));
            });
        }

        return $products->limit($limit)->get();
---
select * from `products` where (`name` like '%surya%' or `sku` like '%surya%' or exists (select * from `categories` where `products`.`category_id` = `categories`.`id` and `name` like '%surya%')) and `products`.`deleted_at` is null order by `name` asc limit 20