app/Http/Middleware/ShareStockMasking.php

select exists(select * from `stock_opname_sessions` where `status` in ('submitted', 'approved') and (`submitted_at` between '2026-04-14 00:00:00' and '2026-04-14 23:59:59' or `approved_at` between '2026-04-14 00:00:00' and '2026-04-14 23:59:59' or `created_at` between '2026-04-14 00:00:00' and '2026-04-14 23:59:59')) as `exists`
---
    public function handle(Request $request, Closure $next)
    {
        $maskStock = false;
        $warehouseId = null;

        $user = Auth::user();
        $role = strtolower((string) ($user?->role ?? ''));

        if (in_array($role, ['admin3', 'admin4'], true) && Schema::hasTable('stock_opname_sessions') && class_exists(StockOpnameSession::class)) {
            $start = now()->startOfDay();
            $end = now()->endOfDay();

            $hasOpname = StockOpnameSession::query()
                ->whereIn('status', ['submitted', 'approved'])
                ->where(function ($q) use ($start, $end) {
                    $q->whereBetween('submitted_at', [$start, $end])
                        ->orWhereBetween('approved_at', [$start, $end])
                        ->orWhereBetween('created_at', [$start, $end]);
                })
                ->exists();