app/Http/Controllers/Minyak/DashboardController.php

select sum(`total_setor`) as aggregate from `minyak_setoran` where date(`tanggal`) = '2026-03-31' and `status` = 'terverifikasi'
select count(*) as aggregate from `minyak_penjualan` where `tanggal_jual` >= '2026-03-01 00:00:00'
select sum(`jumlah_loading`) as aggregate from `minyak_loading` where date(`tanggal`) = '2026-03-31'
select sum(`hutang`) as aggregate from `minyak_penjualan` where `tanggal_jual` >= '2026-03-01 00:00:00' and `tipe_bayar` = 'hutang'
select count(*) as aggregate from `minyak_sales` where `status` = 'aktif' and `minyak_sales`.`deleted_at` is null
select count(*) as aggregate from `minyak_pelanggan` where `status` = 'aktif' and `minyak_pelanggan`.`deleted_at` is null
select count(*) as aggregate from `minyak_produk` where `status` = 'aktif' and `minyak_produk`.`deleted_at` is null
select count(*) as aggregate from `minyak_produk` where `stok_gudang` <= `stok_minimum` and `minyak_produk`.`deleted_at` is null
---
    public function index()
    {
        // Sales users see their own dedicated dashboard
        $user = Auth::user();
        if ($user && str_starts_with(strtolower($user->role ?? ''), 'sales_')) {
            return $this->salesDashboard();
        }

        $today = Carbon::today();
        $thisMonth = Carbon::now()->startOfMonth();

        // Statistik hari ini
        $stats = [
            'penjualan_hari_ini' => MinyakPenjualan::whereDate('tanggal_jual', $today)->sum('total'),
            'transaksi_hari_ini' => MinyakPenjualan::whereDate('tanggal_jual', $today)->count(),
            'setoran_hari_ini' => MinyakSetoran::whereDate('tanggal', $today)->where('status', 'terverifikasi')->sum('total_setor'),
            'loading_hari_ini' => MinyakLoading::whereDate('tanggal', $today)->sum('jumlah_loading'),
        ];

        // Statistik bulan ini
        $statsBulanIni = [
            'total_penjualan' => MinyakPenjualan::where('tanggal_jual', '>=', $thisMonth)->sum('total'),
            'total_transaksi' => MinyakPenjualan::where('tanggal_jual', '>=', $thisMonth)->count(),
            'total_hutang_baru' => MinyakPenjualan::where('tanggal_jual', '>=', $thisMonth)->where('tipe_bayar', 'hutang')->sum('hutang'),
        ];

        // Data master
        $master = [
            'total_sales' => MinyakSales::where('status', 'aktif')->count(),
            'total_pelanggan' => MinyakPelanggan::where('status', 'aktif')->count(),
            'total_produk' => MinyakProduk::where('status', 'aktif')->count(),
            'stok_rendah' => MinyakProduk::whereColumn('stok_gudang', '<=', 'stok_minimum')->count(),
        ];

select sum(`sisa`) as aggregate from `minyak_hutang`
---
        // Hutang overdue
        MinyakHutang::markAllOverdue();
        $hutangOverdue = MinyakHutang::overdue()->count();
        $totalHutang = MinyakHutang::sum('sisa');

select sum(`total`) as aggregate from `minyak_penjualan` where date(`tanggal_jual`) = '2026-03-25'
select * from `minyak_setoran` where `status` = 'pending' order by `tanggal` desc limit 5
---
        $penjualanChart = [];
        for ($i = 6; $i >= 0; $i--) {
            $date = Carbon::now()->subDays($i);
            $penjualanChart[] = [
                'tanggal' => $date->format('d M'),
                'total' => MinyakPenjualan::whereDate('tanggal_jual', $date)->sum('total'),
            ];
        }

        // Setoran pending
        $setoranPending = MinyakSetoran::where('status', 'pending')
            ->with('sales')
            ->orderBy('tanggal', 'desc')
            ->take(5)
            ->get();