app/Http/Controllers/CustomerCreditController.php

    public function index(Request $request)
    {
        $query = CustomerCredit::with(['customer'])->latest();

        if ($request->search) {
            $search = SearchSanitizer::sanitize($request->search);
            $query->where(function ($q) use ($search) {
                $q->where('credit_number', 'like', '%' . $search . '%')
                  ->orWhereHas('customer', fn($q2) => $q2->where('name', 'like', '%' . $search . '%'));
            });
        }
        if ($request->type)   $query->where('type', $request->type);
        if ($request->status) $query->where('status', $request->status);
        if ($request->customer_id) $query->where('customer_id', $request->customer_id);

        $credits   = $query->paginate(20)->withQueryString();
        $customers = Customer::orderBy('name')->get();

        // Summary using DB-level aggregation (avoids loading all records)
        $activeQuery = CustomerCredit::whereIn('status', ['unpaid', 'partial']);
        $totalDebt    = (clone $activeQuery)->where('type', 'debt')->sum(DB::raw('amount - paid_amount'));
        $totalCredit  = (clone $activeQuery)->where('type', 'credit')->sum(DB::raw('amount - paid_amount'));
        $overdueCount = CustomerCredit::whereIn('status', ['unpaid', 'partial'])
                            ->where('due_date', '<', now())->count();
---
select * from `customers` where `customers`.`id` in (1) and `customers`.`deleted_at` is null
select * from `customer_credits` order by `created_at` desc limit 20 offset 0
select * from `customers` where `customers`.`deleted_at` is null order by `name` asc
select sum(amount - paid_amount) as aggregate from `customer_credits` where `type` = 'debt' and `status` in ('unpaid', 'partial')
select count(*) as aggregate from `customer_credits` where `status` in ('unpaid', 'partial') and `due_date` < '2026-04-13 23:55:18'