app/Http/Controllers/DashboardController.php

select sum(`total_amount`) as aggregate from `transactions` where date(`created_at`) = '2026-03-25' and `status` = 'completed'
---
    public function index()
    {
        $user = Auth::user();
        if (! $user) {
            return redirect()->route('login');
        }

        switch ($user->role) {
            case 'supervisor':
                $weeklySales = Cache::remember($this->getCacheKey('weekly_sales'), 300, function () {
                    $sales = [];
                    for ($i = 6; $i >= 0; $i--) {
                        $date = now()->subDays($i)->toDateString();
                        $label = now()->subDays($i)->locale('id')->isoFormat('ddd');
                        $amount = \App\Models\Transaction::whereDate('created_at', $date)
                            ->where('status', 'completed')
                            ->sum('total_amount');

select count(*) as aggregate from `purchase_orders` where `status` in ('ordered', 'partial') and `expected_date` is not null and date(`expected_date`) < '2026-03-31'
---
                    $alertList = [];

                    // PO Terlambat
                    $latePOs = \App\Models\PurchaseOrder::whereIn('status', ['ordered', 'partial'])
                        ->whereNotNull('expected_date')
                        ->whereDate('expected_date', '<', now())
                        ->count();

select count(*) as aggregate from `supplier_debts` where `status` != 'paid' and `due_date` < '2026-03-31 16:01:04'
---
                    }

                    // Hutang Jatuh Tempo
                    $overdueDebts = \App\Models\SupplierDebt::where('status', '!=', 'paid')
                        ->where('due_date', '<', now())
                        ->count();

select count(*) as aggregate from `products` where `stock` <= `min_stock` and `products`.`deleted_at` is null
---
                    }

                    // Stok Minimum
                    $lowStock = \App\Models\Product::whereColumn('stock', '<=', 'min_stock')->count();

select count(*) as aggregate from `product_stocks` where `expired_date` is not null and `stock` > 0 and `expired_date` <= '2026-04-30 16:01:04'
---
                    }

                    // Barang Expired / Akan Expired
                    $expiredStock = \App\Models\ProductStock::whereNotNull('expired_date')
                        ->where('stock', '>', 0)
                        ->where('expired_date', '<=', now()->addDays(30))
                        ->count();

select count(*) as aggregate from `stock_opname_sessions` where `status` = 'submitted'
---
                    }

                    // Opname Pending Approval
                    $pendingOpname = \App\Models\StockOpnameSession::where('status', 'submitted')->count();