app/Http/Controllers/KasirEceranController.php

    public function index()
    {
        $activeSession = \App\Models\PosSession::where('status', 'open')
            ->latest()
            ->first();
---
select * from `pos_sessions` where `status` = 'open' order by `created_at` desc limit 1