app/Http/Controllers/KasirController.php

    private function getExpectedCash(\App\Models\PosSession $session): float
    {
        // Load transactions to use grand_total accessor (includes additional transactions)
        $cashTransactions = Transaction::query()
            ->where('status', 'completed')
            ->whereIn('payment_method', ['cash', 'tunai'])
            ->where('created_at', '>=', $session->created_at)
            ->whereNull('parent_transaction_id')
            ->get();
---
select * from `transactions` where `status` = 'completed' and `payment_method` in ('cash', 'tunai') and `created_at` >= '2026-04-13 16:00:36' and `parent_transaction_id` is null

    public function index()
    {
        $activeSession = \App\Models\PosSession::where('status', 'open')
            ->where('type', 'eceran')
            ->latest()
            ->first();

        if (! $activeSession) {
            return view('kasir.closed', ['type' => 'eceran']);
        }

        // Load root transactions to use grand_total accessor (includes additional transactions)
        $cashTransactions = Transaction::where('status', 'completed')
            ->whereIn('payment_method', ['cash', 'tunai'])
            ->where('created_at', '>=', $activeSession->created_at)
            ->whereNull('parent_transaction_id')
            ->get();
---
select * from `transactions` where `status` = 'completed' and `payment_method` in ('cash', 'tunai') and `created_at` >= '2026-04-13 16:00:36' and `parent_transaction_id` is null