app/Http/Controllers/KasirEceranController.php

    public function index()
    {
        $activeSession = \App\Models\PosSession::where('status', 'open')
            ->where('type', 'eceran')
            ->latest()
            ->first();

        if (! $activeSession) {
            return view('kasir.closed', ['type' => 'eceran']);
        }

        // Load awal: 20 produk pertama
        $products = $this->searchService->getProductsQuery()
            ->limit(20)
            ->get()
            ->map(fn ($p) => $this->searchService->formatProductEceran($p));

        // Load awal: 20 pelanggan pertama
        $customers = \App\Models\Customer::orderBy('name')
            ->limit(20)
            ->get(['id', 'name', 'phone', 'credit_limit', 'current_debt']);
---
select * from `products` where `products`.`deleted_at` is null order by `name` asc limit 20
select `id`, `name`, `phone`, `credit_limit`, `current_debt` from `customers` where `customers`.`deleted_at` is null order by `name` asc limit 20