app/Http/Controllers/KasirGrosirController.php

    public function index()
    {
        // Kasir Grosir tidak perlu modal awal - langsung bisa digunakan
        $products = $this->searchService->getProductsQuery()
            ->limit(20)
            ->get()
            ->map(fn ($p) => $this->searchService->formatProductGrosir($p));

        $customers = \App\Models\Customer::orderBy('name')
            ->limit(20)
            ->get(['id', 'name', 'phone', 'credit_limit', 'current_debt']);

        // Load vehicles for dropdown
        $vehicles = \App\Models\Vehicle::orderBy('license_plate')
            ->get(['id', 'license_plate', 'type']);
---
select * from `products` where `products`.`deleted_at` is null order by `name` asc limit 20
select `id`, `name`, `phone`, `credit_limit`, `current_debt` from `customers` where `customers`.`deleted_at` is null order by `name` asc limit 20
select `id`, `license_plate`, `type` from `vehicles` order by `license_plate` asc

            foreach ($resolvedItems as $item) {
                $product = $products->get($item['product_id']);
                $product->stock -= $item['quantity'];
                $product->save();
---
update `products` set `stock` = 10008, `products`.`updated_at` = '2026-04-07 05:05:24' where `id` = 2