app/Http/Controllers/KasirController.php

    private function getCashInTotal(int $posSessionId): float
    {
        return (float) PosCashMovement::query()
            ->where('pos_session_id', $posSessionId)
            ->where('type', 'in')
            ->sum('amount');
---
select sum(`amount`) as aggregate from `pos_cash_movements` where `pos_session_id` = 1 and `type` = 'in'

    private function getCashOutTotal(int $posSessionId): float
    {
        return (float) PosCashMovement::query()
            ->where('pos_session_id', $posSessionId)
            ->where('type', 'out')
            ->sum('amount');
---
select sum(`amount`) as aggregate from `pos_cash_movements` where `pos_session_id` = 1 and `type` = 'out'

    private function getCreditDpTotal(\App\Models\PosSession $session): float
    {
        return (float) Transaction::query()
            ->where('status', 'completed')
            ->where('payment_method', 'kredit')
            ->where('created_at', '>=', $session->created_at)
            ->sum('paid_amount');
---
select sum(`paid_amount`) as aggregate from `transactions` where `status` = 'completed' and `payment_method` = 'kredit' and `created_at` >= '2026-03-11 22:55:24'

    private function getExpectedCash(\App\Models\PosSession $session): float
    {
        $cashRevenue = (float) Transaction::query()
            ->where('status', 'completed')
            ->whereIn('payment_method', ['cash', 'tunai'])
            ->where('created_at', '>=', $session->created_at)
            ->sum('total_amount');
---
select sum(`total_amount`) as aggregate from `transactions` where `status` = 'completed' and `payment_method` in ('cash', 'tunai') and `created_at` >= '2026-03-11 22:55:24'

    public function index()
    {
        $activeSession = \App\Models\PosSession::where('status', 'open')
            ->latest()
            ->first();

        if (! $activeSession) {
            return view('kasir.closed');
        }

        $cashRevenue = Transaction::where('status', 'completed')
            ->whereIn('payment_method', ['cash', 'tunai'])
            ->where('created_at', '>=', $activeSession->created_at)
            ->sum('total_amount');
---
select * from `pos_sessions` where `status` = 'open' order by `created_at` desc limit 1
select sum(`total_amount`) as aggregate from `transactions` where `status` = 'completed' and `payment_method` in ('cash', 'tunai') and `created_at` >= '2026-03-11 22:55:24'

    public function session()
    {
        $activeSession = \App\Models\PosSession::with('user')
            ->where('status', 'open')
            ->latest()
            ->first();

        if (! $activeSession) {
            return view('kasir.session', [
                'activeSession' => null,
            ]);
        }

        $cashRevenue = Transaction::where('status', 'completed')
            ->whereIn('payment_method', ['cash', 'tunai'])
            ->where('created_at', '>=', $activeSession->created_at)
            ->sum('total_amount');

        $creditDp = $this->getCreditDpTotal($activeSession);
        $cashIn = $this->getCashInTotal($activeSession->id);
        $cashOut = $this->getCashOutTotal($activeSession->id);

        $nonCashRevenue = Transaction::where('status', 'completed')
            ->whereNotIn('payment_method', ['cash', 'tunai'])
            ->where('created_at', '>=', $activeSession->created_at)
            ->sum('total_amount');

        $totalRevenue = Transaction::where('status', 'completed')
            ->where('created_at', '>=', $activeSession->created_at)
            ->sum('total_amount');

        $cashTransactions = Transaction::where('status', 'completed')
            ->whereIn('payment_method', ['cash', 'tunai'])
            ->where('created_at', '>=', $activeSession->created_at)
            ->count();

        $totalTransactions = Transaction::where('status', 'completed')
            ->where('created_at', '>=', $activeSession->created_at)
            ->count();

        $expectedCash = $this->getExpectedCash($activeSession);

        $cashMovements = PosCashMovement::query()
            ->with('user')
            ->where('pos_session_id', $activeSession->id)
            ->latest()
            ->limit(25)
            ->get();
---
select * from `pos_sessions` where `status` = 'open' order by `created_at` desc limit 1
select * from `users` where `users`.`id` in (1)
select sum(`total_amount`) as aggregate from `transactions` where `status` = 'completed' and `payment_method` in ('cash', 'tunai') and `created_at` >= '2026-03-11 22:55:24'
select sum(`total_amount`) as aggregate from `transactions` where `status` = 'completed' and `payment_method` not in ('cash', 'tunai') and `created_at` >= '2026-03-11 22:55:24'
select sum(`total_amount`) as aggregate from `transactions` where `status` = 'completed' and `created_at` >= '2026-03-11 22:55:24'
select count(*) as aggregate from `transactions` where `status` = 'completed' and `payment_method` in ('cash', 'tunai') and `created_at` >= '2026-03-11 22:55:24'
select count(*) as aggregate from `transactions` where `status` = 'completed' and `created_at` >= '2026-03-11 22:55:24'
select * from `pos_cash_movements` where `pos_session_id` = 1 order by `created_at` desc limit 25