app/Http/Controllers/LaporanController.php

    private function shouldMaskStock(): bool
    {
        $user = auth()->user();
        $role = strtolower((string) ($user?->role ?? ''));
        if (! in_array($role, ['admin3', 'admin4'], true)) {
            return false;
        }
        if (! Schema::hasTable('stock_opname_sessions')) {
            return false;
        }
        if (! class_exists(StockOpnameSession::class)) {
            return false;
        }

        $start = now()->startOfDay();
        $end = now()->endOfDay();

        return ! StockOpnameSession::query()
            ->whereIn('status', ['submitted', 'approved'])
            ->where(function ($q) use ($start, $end) {
                $q->whereBetween('submitted_at', [$start, $end])
                    ->orWhereBetween('approved_at', [$start, $end])
                    ->orWhereBetween('created_at', [$start, $end]);
            })
            ->exists();
---
select exists(select * from `stock_opname_sessions` where `status` in ('submitted', 'approved') and (`submitted_at` between '2026-04-14 00:00:00' and '2026-04-14 23:59:59' or `approved_at` between '2026-04-14 00:00:00' and '2026-04-14 23:59:59' or `created_at` between '2026-04-14 00:00:00' and '2026-04-14 23:59:59')) as `exists`

    public function stok(Request $request)
    {
        $isPrint = $request->boolean('print');
        $warehouseId = $request->warehouse_id;
        $categoryId = $request->category_id;
        $search = $request->search;

        // ── Summary cards ────────────────────────────────────────────
        $totalProducts = Product::count();
        $totalStockQty = Product::sum('stock');
        $lowStockCount = Product::whereColumn('stock', '<=', 'min_stock')->where('min_stock', '>', 0)->count();
        $expiredCount = ProductStock::whereNotNull('expired_date')
            ->where('stock', '>', 0)
            ->where('expired_date', '<', Carbon::today())
            ->count();
        $nearExpiredCount = ProductStock::whereNotNull('expired_date')
            ->where('stock', '>', 0)
            ->whereBetween('expired_date', [Carbon::today(), Carbon::today()->addDays(30)])
            ->count();

        // ── Per-warehouse stock summary ───────────────────────────────
        $warehouses = Warehouse::withCount('productStocks as stock_lines')
            ->withSum('productStocks as total_qty', 'stock')
            ->orderBy('name')
            ->get();
---
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select sum(`stock`) as aggregate from `products` where `products`.`deleted_at` is null
select count(*) as aggregate from `products` where `stock` <= `min_stock` and `min_stock` > 0 and `products`.`deleted_at` is null
select count(*) as aggregate from `product_stocks` where `expired_date` is not null and `stock` > 0 and `expired_date` < '2026-04-14 00:00:00'
select count(*) as aggregate from `product_stocks` where `expired_date` is not null and `stock` > 0 and `expired_date` between '2026-04-14 00:00:00' and '2026-05-14 00:00:00'
select `warehouses`.*, (select count(*) from `product_stocks` where `warehouses`.`id` = `product_stocks`.`warehouse_id`) as `stock_lines`, (select sum(`product_stocks`.`stock`) from `product_stocks` where `warehouses`.`id` = `product_stocks`.`warehouse_id`) as `total_qty` from `warehouses` order by `name` asc


        // ── Per-product stok di masing-masing gudang (dari ProductStock) ────
        $productIds = $products->pluck('id');
        $warehouseStocks = ProductStock::with('warehouse:id,name,code')
            ->whereIn('product_id', $productIds)
            ->where('stock', '>', 0)
            ->when($warehouseId, fn ($q) => $q->where('warehouse_id', $warehouseId))
            ->selectRaw('product_id, warehouse_id, SUM(stock) as total_stock')
            ->groupBy('product_id', 'warehouse_id')
            ->get()
            ->groupBy('product_id');

        // ── Low stock products ────────────────────────────────────────
        $lowStockProducts = Product::with(['category'])
            ->whereColumn('stock', '<=', 'min_stock')
            ->where('min_stock', '>', 0)
            ->orderBy('stock', 'asc')
            ->take(10)
            ->get();

        // ── Recent stock movements (last 20) ─────────────────────────
        $recentMovements = StockMovement::with(['product', 'warehouse', 'user'])
            ->latest()
            ->take(15)
            ->get();

        // ── Categories for filter ─────────────────────────────────────
        $categories = \App\Models\Category::orderBy('name')->get();
---
select product_id, warehouse_id, SUM(stock) as total_stock from `product_stocks` where `product_id` in (1, 2, 4) and `stock` > 0 group by `product_id`, `warehouse_id`
select * from `categories` where `categories`.`id` in (2, 5, 7)
select * from `products` where `stock` <= `min_stock` and `min_stock` > 0 and `products`.`deleted_at` is null order by `stock` asc limit 10
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `stock_movements` order by `created_at` desc limit 15
select * from `users` where `users`.`id` in (1)
select * from `categories` order by `name` asc