app/Http/Controllers/PrintController.php

select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (1)
select * from `transactions` where `transactions`.`parent_transaction_id` in (25)
update `transactions` set `print_count` = `print_count` + 1, `transactions`.`updated_at` = '2026-04-14 16:59:43' where `id` = 25
update `transactions` set `last_printed_at` = '2026-04-14 16:59:43', `transactions`.`updated_at` = '2026-04-14 16:59:43' where `id` = 25
---
    public function printReceipt(Transaction $transaction)
    {
        // Load main transaction with details
        $transaction->load(['details.product', 'user', 'customer', 'additionalTransactions.details.product']);

        // Get root transaction (if this is an additional transaction, get the parent)
        $rootTransaction = $transaction->parent_transaction_id
            ? Transaction::with(['details.product', 'user', 'customer', 'additionalTransactions.details.product'])->find($transaction->parent_transaction_id)
            : $transaction;

        // Increment print count
        $rootTransaction->increment('print_count');
        $rootTransaction->update(['last_printed_at' => now()]);

select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (1)
---
    public function printFakturGrosir(Transaction $transaction)
    {
        $transaction->load(['details.product', 'user', 'customer']);