app/Http/Controllers/ProductController.php

    public function index(Request $request)
    {
        $query = Product::with(['category', 'unit', 'unitConversions.unit']);

        if ($request->search) {
            $sanitizedSearch = SearchSanitizer::sanitize($request->search);
            $query->where(function ($q) use ($sanitizedSearch) {
                $q->where('name', 'like', "%{$sanitizedSearch}%")
                    ->orWhere('sku', 'like', "%{$sanitizedSearch}%")
                    ->orWhere('barcode', 'like', "%{$sanitizedSearch}%");
            });
        }
        if ($request->category_id) {
            $query->where('category_id', $request->category_id);
        }

        $products = $query->latest()->paginate(15)->withQueryString();
        $categories = Category::orderBy('name')->get();
---
select * from `categories` where `categories`.`id` in (3)
select * from `products` where `products`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select * from `units` where `units`.`id` in (1, 2, 3, 4)
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select * from `categories` order by `name` asc

    public function update(Request $request, Product $product)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'category_id' => 'required|exists:categories,id',
            'unit_id' => 'nullable|exists:units,id',

            'sku' => 'required|string|unique:products,sku,'.$product->id,
            'barcode' => 'nullable|string|unique:products,barcode,'.$product->id,
            'price' => 'required|numeric|min:0',
            'purchase_price' => 'nullable|numeric|min:0',
            'min_stock' => 'required|integer|min:0',
            'description' => 'nullable|string',
            'units' => 'nullable|array',
            'units.*.unit_id' => 'required|exists:units,id',
            'units.*.conversion_factor' => 'required|integer|min:1',
            'units.*.purchase_price' => 'required|numeric|min:0',
            'units.*.sell_price_ecer' => 'required|numeric|min:0',
            'units.*.sell_price_grosir' => 'required|numeric|min:0',
            'units.*.sell_price_jual1' => 'nullable|numeric|min:0',
            'units.*.sell_price_jual2' => 'nullable|numeric|min:0',
            'units.*.sell_price_jual3' => 'nullable|numeric|min:0',
            'units.*.sell_price_minimal' => 'nullable|numeric|min:0',
            'units.*.is_base_unit' => 'nullable',
        ]);

        try {
            DB::beginTransaction();

            $product->update($request->only([
                'name', 'category_id', 'unit_id',
                'sku', 'barcode', 'price', 'purchase_price',
                'min_stock', 'description',
            ]));
---
update `products` set `price` = '0', `purchase_price` = '26000', `products`.`updated_at` = '2026-04-07 21:37:32' where `id` = 2

    private function saveUnitConversions(Product $product, array $units): void
    {
        // Determine which row is the base unit (from checkbox, or fallback to row with factor=1 or min factor)
        $baseSet = false;
        $minFactor = PHP_INT_MAX;
        $minIdx = 0;

        foreach ($units as $idx => $u) {
            if (isset($u['is_base_unit']) && $u['is_base_unit']) {
                $baseSet = true;
            }
            if ((int) $u['conversion_factor'] < $minFactor) {
                $minFactor = (int) $u['conversion_factor'];
                $minIdx = $idx;
            }
        }

        foreach ($units as $idx => $u) {
            $isBase = isset($u['is_base_unit']) && $u['is_base_unit'];
            if (! $baseSet && $idx === $minIdx) {
                $isBase = true;
            }

            ProductUnitConversion::updateOrCreate(
                ['product_id' => $product->id, 'unit_id' => $u['unit_id']],
                [
                    'conversion_factor' => (int) $u['conversion_factor'],
                    'purchase_price' => (float) $u['purchase_price'],
                    'sell_price_ecer' => (float) $u['sell_price_ecer'],
                    'sell_price_grosir' => (float) $u['sell_price_grosir'],
                    'sell_price_jual1' => (float) ($u['sell_price_jual1'] ?? 0),
                    'sell_price_jual2' => (float) ($u['sell_price_jual2'] ?? 0),
                    'sell_price_jual3' => (float) ($u['sell_price_jual3'] ?? 0),
                    'sell_price_minimal' => (float) ($u['sell_price_minimal'] ?? 0),
                    'is_base_unit' => $isBase,
                ]
            );
---
insert into `product_unit_conversions` (`product_id`, `unit_id`, `conversion_factor`, `purchase_price`, `sell_price_ecer`, `sell_price_grosir`, `sell_price_jual1`, `sell_price_jual2`, `sell_price_jual3`, `sell_price_minimal`, `is_base_unit`, `updated_at`, `created_at`) values (2, '1', 1, 26000, 0, 0, 0, 0, 0, 0, 1, '2026-04-07 21:37:32', '2026-04-07 21:37:32')
select * from `product_unit_conversions` where (`product_id` = 2 and `unit_id` = '1') limit 1