app/Http/Controllers/TransactionController.php

    public function index(Request $request)
    {
        // Only show root transactions (not additional/child transactions)
        $query = Transaction::with(['user', 'details.product', 'additionalTransactions', 'customer'])
            ->whereNull('parent_transaction_id')
            ->latest();

        // Filters
        if ($request->search) {
            $sanitizedSearch = SearchSanitizer::sanitize($request->search);
            $query->where('id', $request->search)
                ->orWhereHas('user', fn ($q) => $q->where('name', 'like', "%{$sanitizedSearch}%"));
        }
        if ($request->payment_method) {
            $query->where('payment_method', $request->payment_method);
        }
        if ($request->status) {
            $query->where('status', $request->status);
        }
        if ($request->date_from) {
            $query->whereDate('created_at', '>=', $request->date_from);
        }
        if ($request->date_to) {
            $query->whereDate('created_at', '<=', $request->date_to);
        }
        // Filter by customer type (eceran/grosir)
        if ($request->customer_type) {
            $query->whereHas('customer', fn ($q) => $q->where('category', $request->customer_type));
---
select * from `customers` where `customers`.`id` in (1) and `customers`.`deleted_at` is null
select * from `products` where `products`.`id` in (1, 2) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (1)

        // Summary only counts root transactions
        $summaryQuery = Transaction::query()->whereNull('parent_transaction_id');
        if ($request->date_from) {
            $summaryQuery->whereDate('created_at', '>=', $request->date_from);
---
select * from `transactions` where `transactions`.`parent_transaction_id` in (1, 2, 3, 4, 5, 6, 14, 16, 17, 18, 19, 20, 21, 22, 23)


        $totalRevenue = (clone $summaryQuery)->where('status', 'completed')->sum('total_amount');
        $totalCount = (clone $summaryQuery)->where('status', 'completed')->count();
        $todayRevenue = Transaction::whereDate('created_at', today())->where('status', 'completed')->sum('total_amount');
        $todayCount = Transaction::whereDate('created_at', today())->where('status', 'completed')->count();
---
select sum(`total_amount`) as aggregate from `transactions` where date(`created_at`) = '2026-04-14' and `status` = 'completed'
select count(*) as aggregate from `transactions` where date(`created_at`) = '2026-04-14' and `status` = 'completed'

    public function show(Transaction $transaksi)
    {
        // Load additional transactions relation
        $transaksi->load(['user', 'details.product.category', 'details.warehouse', 'customer', 'additionalTransactions.details.product.category']);
---
select * from `categories` where `categories`.`id` in (3)
select * from `customers` where `customers`.`id` in (1) and `customers`.`deleted_at` is null
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `users` where `users`.`id` in (1)