app/Http/Requests/Auth/LoginRequest.php

select * from `users` where `email` = 'admin@dodpos.com' limit 1
---
    public function authenticate(): void
    {
        $this->ensureIsNotRateLimited();

        $credentials = $this->only('email', 'password');

        // Check for inactive/unapproved users first to provide a clear message
        $user = User::where('email', $credentials['email'])->first();