app/Models/StoreSetting.php

select * from `store_settings` limit 1
---
    public static function current(): self
    {
        $existing = self::query()->first();