app/Models/User.php

    public static function isValidRole(?string $role): bool
    {
        if ($role === null) {
            return false;
        }

        $role = strtolower(trim(str_replace(' ', '', $role)));

        try {
            if (Schema::hasTable('app_roles')) {
                $exists = \App\Models\AppRole::query()
                    ->where('key', $role)
                    ->where('active', true)
                    ->exists();
---
select exists(select * from `app_roles` where `key` = 'supervisor' and `active` = 1) as `exists`